[Room] is not in a properly enclosed region
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RoomNotEnclosedSpaces { get; }
  Visual Basic
Public Shared ReadOnly Property RoomNotEnclosedSpaces As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RoomNotEnclosedSpaces {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoomFailures Class
  Autodesk.Revit.DB Namespace